In [4]:
import numpy as np
import pandas as pd

In [16]:
df1= pd.DataFrame({
    'Store': ['A', 'B', 'C'],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'code': [111,222,333],
    
})
print("first data")
df1

first data

  Store         City  code
0     A     New York   111
1     B  Los Angeles   222
2     C      Chicago   333

In [18]:
df2 = pd.DataFrame({
    'Store': ['A', 'B', 'C'],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'owner':['alex','james','bob']
})
print("second data" )
df2

second data

  Store         City  owner
0     A     New York   alex
1     B  Los Angeles  james
2     C      Chicago    bob

In [23]:
# merging two data frames
print("merged data")
pd.merge(df1,df2)

merged data

  Store         City  code  owner
0     A     New York   111   alex
1     B  Los Angeles   222  james
2     C      Chicago   333    bob

## #2

In [34]:

# Employee DataFrame
employees = pd.DataFrame({
    'EmpID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'DeptID': [10, 20, 10, 30]
})
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      10
3      4    David      30

In [33]:
# Department DataFrame
departments = pd.DataFrame({
    'DeptID': [10, 20, 40],
    'DeptName': ['HR', 'Engineering', 'Finance']
})
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40      Finance

In [29]:
#inner merge-(merge by same keys present in both data ie.deptID;10 20 )
inner_merge= pd.merge(employees,departments , on = "DeptID",how="inner")
print(inner_merge)

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      10           HR

In [41]:
# outer merge(all keys from both data frames)
outer_merge=pd.merge(employees, departments, how="outer")
outer_merge

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    3.0  Charlie      10           HR
2    2.0      Bob      20  Engineering
3    4.0    David      30          NaN
4    NaN      NaN      40      Finance

In [45]:
# left merge
left_merge= pd.merge(employees,departments,how="left")
left_merge

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      10           HR
3      4    David      30          NaN

In [47]:
# right merge
right_merge= pd.merge(employees, departments , how= "right")
right_merge

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    3.0  Charlie      10           HR
2    2.0      Bob      20  Engineering
3    NaN      NaN      40      Finance

In [61]:
# merge on multiple column
employees = pd.DataFrame({
    'EmpID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David',],
    'DeptID': [10, 20, 10, 30],
    'Location': ['NY', 'LA', 'NY', 'SF']
    
})

# Department DataFrame
departments = pd.DataFrame({
    'DeptID': [10, 20, 40,30],
    'DeptName': ['HR', 'Engineering', 'Finance','Marketing'],
    'Location': ['NY', 'LA', 'NY', 'SF']
})
multi_merge= pd.merge(employees, departments, on=['DeptID','Location'],how="inner")
multi_merge

   EmpID     Name  DeptID Location     DeptName
0      1    Alice      10       NY           HR
1      2      Bob      20       LA  Engineering
2      3  Charlie      10       NY           HR
3      4    David      30       SF    Marketing